# GetInputReferences Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler..::..GetInputReferences Method
StructuralConnectionHandler Class See Also
---
Gets references of input elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IList<Reference> GetInputReferences()
```

Visual Basic
---
```text
Public Function GetInputReferences As IList(Of Reference)
```

Visual C++
---
```text
public:
IList<Reference^>^ GetInputReferences()
```

# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace